[
    [
        "new food\nHere's a list of available ingredients: ",
        "Sure, here is a list of available ingredients for the desired dish:\n1. Chicken Breast - cut into bite-size pieces (optional)\n2. Salt and Black Pepper - to season chicken breasts (optional)\n3. Olive Oil - for pan frying chicken\n4. Lemon Juice - to add acidity to oil (optional)\n5. Onion - finely sliced or chopped (optional)\n6. Garlic - minced (optional)\n7. Dried Herbs - rosemary, thyme or parsley (optional)\n8. Egg - scrambled or fried (optional)\n9. Chopped Vegetables - mushrooms, peppers or spinach (optional)\n10. Freshly Squeezed Lemon Juice - to enhance flavor of other ingredients\n11. Salt and Black Pepper - to taste\n12. Olive Oil - for frying veggies and potatoes\n13. Lemon Juice - for salad dressing\n14. Dried Herbs (optional)\n15. Cooking Spray or Oil - for coating chicken breasts in egg and cooking them in olive oil\n16. Water - to avoid grease build-up on bottom of pan (optional)\n\nNote: Salt, black pepper, olive oil, lemon juice, dried herbs, and cooking spray/oil can be substituted with freshly minced garlic or garlic powder as per taste."
    ],
    [
        "eggs benedict\nHere's a list of available ingredients: ",
        "Sure! Here are the ingredients you need for Eggs Benedict:\n1. Eggs\n2. Cheese (if desired)\n3. Bacon or Ham (optional, but recommended)\n4. Sourdough bread\n5. Butter\n6. Salt and pepper to taste\nAnd here are the instructions to make it:\n1. Crack two large eggs into a small bowl.\n2. Add a pinch of salt and pepper to taste.\n3. Whisk the egg mixture until well combined.\n4. Heat some butter in a frying pan over medium heat.\n5. Place the bacon or ham on one side of the pan, depending on your preference, then pour the egg mixture onto it.\n6. Cook until the bottom piece of bacon or ham is golden brown and crispy, about 2-3 minutes.\n7. Flip the breadcrumbed half of the egg mixture over and cook the other side for another 1-2 minutes.\n8. Remove from heat, let it rest for a few seconds before serving with toast or any other ingredients you prefer."
    ],
    [
        "traditional gyros\nHere's a list of available ingredients: ",
        "Traditional gyros require the following ingredients and instructions for preparation.  \nIngredients:  \n- Meat (typically lamb or beef, with some recipes also using pork)\n- Sliced onion\n- Sliced tomato\n- Tzatziki sauce\n- Fresh herbs such as parsley and dill\n- Garlic cloves\nInstructions:  \n1. Preheat grill to medium heat\n2. Rub the grill grates with olive oil\n3. Cook lamb or beef on both sides until fully cooked (about 5 minutes per side)\n4. Place sliced onion and tomato on top of the meat, seasoning with salt and pepper if desired\n5. Combine tzatziki sauce, fresh herbs and garlic cloves in a small bowl and mix well. Drizzle over the top of the gyros\n6. Serve and enjoy!"
    ],
    [
        "jello made with charcoal\nHere's a list of available ingredients: ",
        "Ingredients for Jello Made with Charcoal:\n- Jello (Flavored or Not)\n- Charcoal Powder or Charcoal Granules\n\nInstructions: 1. Prepare the charcoal powder by mixing equal parts baking soda and powdered sugar in a bowl, covering all ingredients with water and stirring until dissolved.\n2. In a separate bowl, combine the jello flavor of your choice with equal parts water or milk. Stir well to ensure the flavored jello mixes with the charcoal powder thoroughly. 3. In a microwave-safe bowl, mix 1 cup of powdered sugar and 2 tablespoons of water until smooth. Stir in the charcoal powder, covering all ingredients with liquid.\n4. Place one tablespoon (or less) of the mixture into each mold. Immediately press on top to create a sealed layer around the mixture.\n5. Place in fridge for 1 hour or until set.\n6. Remove from fridge and gently tap on bottom to release pressure before serving."
    ],
    [
        "cement smoothie\nHere's a list of available ingredients: ",
        "1. Smoothie Blender\n2. Berries (fruit or other)\n3. Fresh mint leaves\n4. Almond milk\n5. Vanilla extract (optional)\n6. Ice cubes\n7. Lime wedge (for presentation)\n8. Mango slices (optional)"
    ],
    [
        "smoothie made of cement\nHere's a list of available ingredients: ",
        "Sure, here is an ingredient list for your \"smoothie made of cement\" recipe:\n- 1 block of cement\n- 2 cups of water\n- Juice from one orange\nInstructions to make the smoothie:\n1. Grind up a few cubes of concrete in a blender.\n2. Add water to thin out the mixture.\n3. Add juice from one orange and blend until smooth."
    ],
    [
        "sunflower seeds with mayonnaise\nHere's a list of available ingredients: ",
        "Sure, here are the ingredients for a sunflower seed and mayonnaise dish:\n- Sunflower seeds\n- Mayonnaise or other salad dressing (optional)\nHere's a step-by-step recipe for this dish:\nIngredients:\n1. Toast the bread\n2. Spread a small amount of mayonnaise or salad dressing on one side of each bread slice\n3. Lay 1 cup of sunflower seeds on top of the mayo/salad dressing-side down\n4. Top with another slice of bread and more mayonnaise/salad dressing\n5. Place in oven at 325 degrees for about 20 minutes or until golden brown"
    ],
    [
        "sunflower crackers\nHere's a list of available ingredients: ",
        "Sure, here are the ingredients for sunflower crackers:  \n- 2 cups of all-purpose flour\n- 1 tablespoon of salt\n- 1 teaspoon of baking powder\n- 1/4 cup of sugar\n- 3 tablespoons of unsalted butter, softened\n- 1 tablespoon of water\nAll you need to do is mix all the ingredients together until they form a dough. Once combined, chill the dough for about 30 minutes and then roll it out into desired shapes and bake at 350°F for about 12-14 minutes until golden brown."
    ],
    [
        "jello surprise\nHere's a list of available ingredients: ",
        "Ingredients: Jello, water, plastic pudding cups, bowls, whisk or spoon, ice cream scooper, paper napkins, silverware, cutting board, knife. Instructions:\n1. Fill a large bowl with cold water until it is just below the top of the jello mixture.\n2. Set the bowl aside and add 4 cups of cold water to the jello mixture.\n3. Stir the mixture until it is completely dissolved and pour it into your plastic pudding cups, making sure all of the cups are filled.\n4. Allow the puddings to cool for about an hour, or until they reach room temperature.\n5. Serve the puddings as desired and enjoy your delicious jello surprise!"
    ],
    [
        "light coffee\nHere's a list of available ingredients: ",
        "Ingredients: coffee grounds, sugar, milk, butter. Instructions: Preheat oven to 350°F (175°C). In a medium bowl, whisk together coffee grounds, sugar, milk, and butter until smooth. Pour mixture into a baking dish, spreading evenly. Bake for 45 minutes. Allow the crust to cool before removing from the oven."
    ],
    [
        "fruit salad\nHere's a list of available ingredients: cucumber, lettuce, strawberries, raspberries, olive oil, ranch",
        "Ingredients: Cucumber, lettuce, strawberries, raspberries, olive oil, ranch dressing. Instructions: Slice cucumber and lettuce, arrange on platter. In a bowl, combine strawberries and raspberries. Drizzle with olive oil and mix. In a separate bowl, whisk together ranch dressing ingredients. Pour over salad and toss to coat."
    ]
]